LonelyWolf/stm32/stm32l151rdt6-dev/sdcard-sdio.c
#include <stm32l1xx_rcc.h>
#include <stm32l1xx_gpio.h>

#include "usb_lib.h"

#include "sdcard-sdio.h"


SDCard_TypeDef SDCard;                 // SD card parameters


// Configure the SDIO corresponding GPIO
void SD_SDIO_GPIO_Init(void) {
	GPIO_InitTypeDef PORT;

	// Enable SDIO corresponding GPIO peripherals
	RCC->AHBENR |= SDIO_GPIO_PERIPH;

/*
	GPIOD->MODER &= ~GPIO_MODER_MODER2; // Clear bits
	GPIOD->MODER |=  GPIO_MODER_MODER2_1; // Alternate function mode
	GPIOD->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR2; // High speed
	GPIOD->OTYPER &= ~GPIO_OTYPER_OT_2; // Output push-pull (reset state)
*/

	PORT.GPIO_Mode = GPIO_Mode_AF; // Alternative function mode
	PORT.GPIO_Speed = GPIO_Speed_40MHz; // High speed
	PORT.GPIO_OType = GPIO_OType_PP; // Output push-pull
	PORT.GPIO_PuPd = GPIO_PuPd_UP; // Pull-up

	// SDIO_CMD (PD2)
	PORT.GPIO_Pin = GPIO_Pin_2;
	GPIO_Init(GPIOD,&PORT);

	// SDIO_D0 (PC8)
	PORT.GPIO_Pin = GPIO_Pin_8;
	GPIO_Init(GPIOC,&PORT);

	// SDIO_D1 (PC9)
	PORT.GPIO_Pin = GPIO_Pin_9;
	GPIO_Init(GPIOC,&PORT);

	// SDIO_D2 (PC10)
	PORT.GPIO_Pin = GPIO_Pin_10;
	GPIO_Init(GPIOC,&PORT);

	// SDIO_D3 (PC11)
	PORT.GPIO_Pin = GPIO_Pin_11;
	GPIO_Init(GPIOC,&PORT);

	// SDIO_CK (PC12)
	PORT.GPIO_Pin = GPIO_Pin_12;
	GPIO_Init(GPIOC,&PORT);

	// Enable pin alternate functions
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource2,SDIO_GPIO_AF);
	GPIO_PinAFConfig(GPIOC,GPIO_PinSource8,SDIO_GPIO_AF);
	GPIO_PinAFConfig(GPIOC,GPIO_PinSource9,SDIO_GPIO_AF);
	GPIO_PinAFConfig(GPIOC,GPIO_PinSource10,SDIO_GPIO_AF);
	GPIO_PinAFConfig(GPIOC,GPIO_PinSource11,SDIO_GPIO_AF);
	GPIO_PinAFConfig(GPIOC,GPIO_PinSource12,SDIO_GPIO_AF);

	// Enable the SDIO peripheral
	RCC->APB2ENR |= RCC_APB2ENR_SDIOEN;

	// Configure SDIO peripheral clock
	// HW flow control disabled, Rising edge of SDIOCLK, 1-bit bus, Power saving disabled, SDIOCLK bypass disabled
	SDIO->CLKCR = SD_BUS_1BIT | SDIO_CLK_DIV_INIT | SDIO_CLKCR_CLKEN; // 400MHz speed, clock enabled

	// Disable SDIO clock
	SDIO->POWER = SDIO_PWR_OFF;
}

// Send command to the SD card
// input:
//   cmd - SD card command
//   arg - 32-bit argument for SD card command
//   resp_type - response type (SDIO_RESP_xxx)
// return: SDResult value
SDResult SD_Cmd(uint8_t cmd, uint32_t arg, uint16_t resp_type) {
	uint32_t wait = SDIO_CMD_TIMEOUT;

	// Clear the command flags
	SDIO->ICR = SDIO_ICR_CCRCFAILC | SDIO_ICR_CTIMEOUTC | SDIO_ICR_CMDRENDC | SDIO_ICR_CMDSENTC;

	// Command argument value
	SDIO->ARG = arg;

	// Write to SDIO CMD
	SDIO->CMD = resp_type | cmd | SDIO_CMD_CPSMEN;

	// Block till get a response
	if (resp_type == SDIO_RESP_NONE) {
		// Wait for timeout or CMD sent flag
		while (!(SDIO->STA & (SDIO_STA_CTIMEOUT | SDIO_STA_CMDSENT)) && --wait);
	} else {
		// Wait for CMDSENT or CRCFAIL
		while (!(SDIO->STA & (SDIO_STA_CTIMEOUT | SDIO_STA_CMDREND | SDIO_STA_CCRCFAIL)) && --wait);
	}

	// Check response
	if ((SDIO->STA & SDIO_STA_CTIMEOUT) || !wait) return SDR_Timeout;
	if (SDIO->STA & SDIO_STA_CCRCFAIL) return SDR_CRCError; // CRC fail will be always for R3 response

	return SDR_Success;
}

// Get response from the SD card
// input:
//   resp_type - response type (SD_Rxx values)
//   pResp - pointer to the array for response (1..4 32-bit values)
// return:
//   for R1 or R1b responses:
//     SDR_Success if no error or SDR_BadResponse in case of some error bits set
//     response points to card status value
//   for R2 response:
//     result always is SDR_Success
//     response points to 128-bit CSD or CID register value
//   for R3 response:
//     SDR_Success if no error or SDR_BadResponse in case of bad OCR register header
//     response points to 32-bit OCR register value
//   for R6 response:
//     SDR_Success if no error or SDR_BadResponse in case of bad RCA response
//     response points to 32-bit RCA value
//   for R7 response:
//     SDR_Success if no error or SDR_BadResponse in case of bad R7 response header
//     response points to 32-bit value of R7 response
SDResult SD_Response(uint16_t resp_type, uint32_t *pResp) {
	SDResult result = SDR_Success;

	// Get first 32-bit value, it similar for all types of response except R2
	*pResp = SDIO->RESP1;

	switch (resp_type) {
		case SD_R1:
		case SD_R1b:
			// RESP1 contains card status information
			// Check for error bits in card status
			if (*pResp & SD_CS_ERROR_BITS) result = SDR_BadResponse;
			break;
		case SD_R2:
			// RESP1..4 registers contain the CID/CSD register value
#ifdef __GNUC__
			// Use GCC built-in intrinsics (fastest, less code) (GCC v4.3 or later)
			*pResp++ = __builtin_bswap32(SDIO->RESP1);
			*pResp++ = __builtin_bswap32(SDIO->RESP2);
			*pResp++ = __builtin_bswap32(SDIO->RESP3);
			*pResp   = __builtin_bswap32(SDIO->RESP4);
#else
			// Use ARM 'REV' instruction (fast, a bit bigger code than GCC intrinsics)
			*pResp++ = __REV(SDIO->RESP1);
			*pResp++ = __REV(SDIO->RESP2);
			*pResp++ = __REV(SDIO->RESP3);
			*pResp   = __REV(SDIO->RESP4);
			// Use SHIFT, AND and OR (slower, biggest code)
//			*pResp++ = SWAP_UINT32(SDIO->RESP1);
//			*pResp++ = SWAP_UINT32(SDIO->RESP2);
//			*pResp++ = SWAP_UINT32(SDIO->RESP3);
//			*pResp   = SWAP_UINT32(SDIO->RESP4);
#endif
			break;
		case SD_R3:
			// RESP1 contains the OCR register value
			// Check for correct OCR header
			if (SDIO->RESPCMD != 0x3f) result = SDR_BadResponse;
			break;
		case SD_R6:
			// RESP1 contains the RCA response value
			// Only CMD3 generates R6 response, so RESPCMD must be 0x03
			if (SDIO->RESPCMD != 0x03) result = SDR_BadResponse;
			break;
		case SD_R7:
			// RESP1 contains 'Voltage accepted' and echo-back of check pattern
			// Only CMD8 generates R7 response, so RESPCMD must be 0x08
			if (SDIO->RESPCMD != 0x08) result = SDR_BadResponse;
			break;
		default:
			// Unknown response
			result = SDR_BadResponse;
			break;
	}

	return result;
}

// Find the SD card SCR register value
// input:
//   pSCR - pointer to the SCR register value
// return: SDResult value
// note: card must be in transfer mode, not supported by MMC
SDResult SD_GetSCR(uint32_t *pSCR) {
	SDResult cmd_res;
	uint32_t response;

	// Set block size to 8 bytes
	SD_Cmd(SD_CMD_SET_BLOCKLEN,8,SDIO_RESP_SHORT); // CMD16
	cmd_res = SD_Response(SD_R1,&response);
	if (cmd_res != SDR_Success) return cmd_res;

	// Send leading command for ACMD<n> command
	SD_Cmd(SD_CMD_APP_CMD,SDCard.RCA << 16,SDIO_RESP_SHORT); // CMD55
	cmd_res = SD_Response(SD_R1,&response);
	if (cmd_res != SDR_Success) return cmd_res;

	// Clear the data flags
	SDIO->ICR = SDIO_ICR_RXOVERRC | SDIO_ICR_DCRCFAILC | SDIO_ICR_DTIMEOUTC | SDIO_ICR_DBCKENDC | SDIO_ICR_STBITERRC;

