LonelyWolf/stm32/stm32l151rdt6-dev/sdcard-sdio.c
	// Configure the SDIO data transfer
	SDIO->DTIMER = SDIO_DATA_TIMEOUT; // Timeout
	SDIO->DLEN   = 8; // Data length in bytes
	// Data transfer: block, card -> controller, size: 2^3 = 8bytes, enable data transfer
	SDIO->DCTRL  = SDIO_DCTRL_DTDIR | (3 << 4) | SDIO_DCTRL_DTEN;

	// Send SEND_SCR command
	SD_Cmd(SD_CMD_SEND_SCR,0,SDIO_RESP_SHORT); // ACMD51
	cmd_res = SD_Response(SD_R1,&response);
	if (cmd_res != SDR_Success) return cmd_res;

	// Read a SCR register value from SDIO FIFO
	while (!(SDIO->STA & (SDIO_STA_RXOVERR | SDIO_STA_DCRCFAIL | SDIO_STA_DTIMEOUT | SDIO_STA_DBCKEND | SDIO_STA_STBITERR))) {
		// Read word when data available in receive FIFO
		if (SDIO->STA & SDIO_STA_RXDAVL) *pSCR++ = SDIO->FIFO;
	}

	// Check for errors
	if (SDIO->STA & SDIO_STA_DTIMEOUT) cmd_res = SDR_DataTimeout;
	if (SDIO->STA & SDIO_STA_DCRCFAIL) cmd_res = SDR_DataCRCFail;
	if (SDIO->STA & SDIO_STA_RXOVERR)  cmd_res = SDR_RXOverrun;
	if (SDIO->STA & SDIO_STA_STBITERR) cmd_res = SDR_StartBitError;

	// Clear the static SDIO flags
	SDIO->ICR = SDIO_ICR_STATIC;

	return cmd_res;
}

// Initialize the SD card
// return: SDResult value
// note: SDIO peripheral clock must be on and SDIO GPIO configured
SDResult SD_Init(void) {
	uint32_t trials;
	uint32_t response[4];
	uint32_t sd_type = SD_STD_CAPACITY; // SD card capacity
	SDResult cmd_res;

	// Populate SDCard structure with default values
	SDCard.Capacity = 0;
	SDCard.MaxBusClkFreq = 0;
	SDCard.BlockSize = 0;
	SDCard.CSDVer = 0;
	SDCard.Type = SDCT_UNKNOWN;
	SDCard.RCA = 0;

	SDIO->POWER = SDIO_PWR_ON; // Enable SDIO clock

	SD_Cmd(SD_CMD_GO_IDLE_STATE,0x00,SDIO_RESP_NONE);

	// CMD8: SEND_IF_COND. Send this command to verify SD card interface operating condition
	// Argument: - [31:12]: Reserved (shall be set to '0')
	//           - [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
	//           - [7:0]: Check Pattern (recommended 0xAA)
	cmd_res = SD_Cmd(SD_CMD_HS_SEND_EXT_CSD,SD_CHECK_PATTERN,SDIO_RESP_SHORT); // CMD8
	if (cmd_res == SDR_Success) {
		// SD v2.0 or later

		// Get and check R7 response
		if (SD_Response(SD_R7,response) != SDR_Success) return SDR_BadResponse;
		// Check echo-back of check pattern
		if ((response[0] & 0x01ff) != (SD_CHECK_PATTERN & 0x01ff)) return SDR_Unsupported;
		sd_type = SD_HIGH_CAPACITY; // SD v2.0 or later

		// Issue ACMD41 command
		trials = SDIO_ACMD41_TRIALS;
		while (--trials) {
			// Send leading command for ACMD<n> command
			SD_Cmd(SD_CMD_APP_CMD,0,SDIO_RESP_SHORT); // CMD55 with RCA 0
			if (SD_Response(SD_R1,response) != SDR_Success) return SDR_BadResponse;
			// ACMD41 - initiate initialization process.
			// Set 3.0-3.3V voltage window (bit 20)
			// Set HCS bit (30) (Host Capacity Support) to inform card what host support high capacity
			// Set XPC bit (28) (SDXC Power Control) to use maximum performance (SDXC only)
			SD_Cmd(SD_CMD_SD_SEND_OP_COND,SD_OCR_VOLTAGE | sd_type,SDIO_RESP_SHORT);
			if (SD_Response(SD_R3,response) != SDR_Success) return SDR_BadResponse;
			// Check if card finished power up routine
			if (response[0] & (1 << 31)) break;
		}
		if (!trials) return SDR_InvalidVoltage; // Unsupported voltage range
		// Check if card is SDHC/SDXC
		SDCard.Type = (response[0] & SD_HIGH_CAPACITY) ? SDCT_SDHC : SDCT_SDSC_V2;
	} else if (cmd_res == SDR_Timeout) {
		// SD v1.x or MMC

		// Issue CMD55 to reset 'Illegal command' bit of the SD card
		SD_Cmd(SD_CMD_APP_CMD,0,SDIO_RESP_SHORT); // CMD55 with RCA 0

		// Issue ACMD41 command with zero argument
		trials = SDIO_ACMD41_TRIALS;
		while (--trials) {
			// Send leading command for ACMD<n> command
			SD_Cmd(SD_CMD_APP_CMD,0,SDIO_RESP_SHORT); // CMD55 with RCA 0
			if (SD_Response(SD_R1,response) != SDR_Success) return SDR_BadResponse;
			// ACMD41 - initiate initialization process (bit HCS = 0)
			// R3 response do not protected with CRC and here will be CRC error
			cmd_res = SD_Cmd(SD_CMD_SD_SEND_OP_COND,SD_OCR_VOLTAGE,SDIO_RESP_SHORT);
			if (cmd_res == SDR_Timeout) break; // MMC will not respond to this command
			if (SD_Response(SD_R3,response) != SDR_Success) return SDR_BadResponse;
			// Check if card finished power up routine
			if (response[0] & (1 << 31)) break;
		}
		if (!trials) return SDR_UnknownCard; // Unsupported card
		if (cmd_res != SDR_Timeout) {
			// SD v1.x
			SDCard.Type = SDCT_SDSC_V1; // SDv1
		} else {
			// MMC or not SD memory card

			///////////////////////////////////////////////////////////
			// This part is not checked due to lack of MMCmicro card //
			///////////////////////////////////////////////////////////

			trials = SDIO_ACMD41_TRIALS;
			while (--trials) {
				// Issue CMD1: initiate initialization process.
				SD_Cmd(SD_CMD_SEND_OP_COND,SD_OCR_VOLTAGE,SDIO_RESP_SHORT); // CMD1
				if (SD_Response(SD_R3,response) != SDR_Success) return SDR_BadResponse;
				// Check if card finished power up routine
				if (response[0] & (1 << 31)) break;
			}
			if (!trials) return SDR_UnknownCard;
			SDCard.Type = SDCT_MMC; // MMC
		}
	} else return cmd_res;

	// CMD2 and CMD3 commands should be issued in cycle until timeout to enumerate all cards on the bus.
	// Since this module suitable to work with single card, issue this commands one time only.

	// Send ALL_SEND_CID command
	cmd_res = SD_Cmd(SD_CMD_ALL_SEND_CID,0,SDIO_RESP_LONG); // CMD2
	if (cmd_res != SDR_Success) return cmd_res;
	SD_Response(SD_R2,(uint32_t *)SDCard.CID); // Retrieve CID register from the card

	// Send SEND_REL_ADDR command (ask the card to publish a new RCA (Relative Card Address)
	// Once the RCA is received the card state changes to the stand-by state
	if (SDCard.Type != SDCT_MMC) {
		// SD
		cmd_res = SD_Cmd(SD_CMD_SEND_REL_ADDR,0,SDIO_RESP_SHORT); // CMD3
		if (cmd_res != SDR_Success) return cmd_res;
		SD_Response(SD_R6,response);
	} else {
		// MMC
		cmd_res = SD_Cmd(SD_CMD_SEND_REL_ADDR,1 << 16,SDIO_RESP_SHORT); // CMD3
		if (cmd_res != SDR_Success) return cmd_res;
		SD_Response(SD_R2,response);
	}
	SDCard.RCA = response[0] >> 16;

	// Send SEND_CSD command
	cmd_res = SD_Cmd(SD_CMD_SEND_CSD,SDCard.RCA << 16,SDIO_RESP_LONG); // CMD9
	if (cmd_res != SDR_Success) return cmd_res;
	SD_Response(SD_R2,(uint32_t *)SDCard.CSD); // Retrieve CSD register from the card

