LonelyWolf/stm32/stm32l151rdt6-dev/sdcard-sdio.c
	// Parse CID/CSD registers
	SD_GetCardInfo();

	// Now card must be in stand-by mode, from this point it is possible to increase bus speed.

	// Configure SDIO peripheral clock
	// HW flow control disabled, Rising edge of SDIOCLK, 1-bit bus, Power saving disabled, SDIOCLK bypass disabled
	SDIO->CLKCR = SD_BUS_1BIT | SDIO_CLK_DIV_TRAN | SDIO_CLKCR_CLKEN; // Data transfer speed, clock enabled

	// Put the SD card in transfer mode
	SD_Cmd(SD_CMD_SEL_DESEL_CARD,SDCard.RCA << 16,SDIO_RESP_SHORT); // CMD7
	cmd_res = SD_Response(SD_R1b,response);
	if (cmd_res != SDR_Success) return cmd_res;

	// Disable the pull-up resistor on CD/DAT3 pin of card
	// Send leading command for ACMD<n> command
	SD_Cmd(SD_CMD_APP_CMD,SDCard.RCA << 16,SDIO_RESP_SHORT); // CMD55
	cmd_res = SD_Response(SD_R1,response);
	if (cmd_res != SDR_Success) return cmd_res;
	// Send SET_CLR_CARD_DETECT command
	SD_Cmd(SD_CMD_SET_CLR_CARD_DETECT,0,SDIO_RESP_SHORT); // ACMD42
	cmd_res = SD_Response(SD_R1,response);
	if (cmd_res != SDR_Success) return cmd_res;

	// Read the SCR register
	if (SDCard.Type != SDCT_MMC) {
		// MMC card doesn't support this feature
		SD_GetSCR((uint32_t *)SDCard.SCR);
	}

	// For SDv1,SDv2 and MMC card must set block size (SDHC/SDXC always have fixed size 512bytes)
	if ((SDCard.Type == SDCT_SDSC_V1) || (SDCard.Type == SDCT_SDSC_V2) || (SDCard.Type == SDCT_MMC)) {
		SD_Cmd(SD_CMD_SET_BLOCKLEN,512,SDIO_RESP_SHORT); // CMD16
		cmd_res = SD_Response(SD_R1,response);
		if (cmd_res != SDR_Success) return SDR_SetBlockSizeFailed;
	}

/*
	// Turn off CRC checks - will it work in SDIO mode?
	SD_Cmd(SD_CMD_CRC_ON_OFF,0,SD_R1,resp); // CMD59
	// Turn on CRC checks
	SD_Cmd(SD_CMD_CRC_ON_OFF,1,SD_R1,resp); // CMD59
*/

	return SDR_Success;
}

// Set SDIO bus width
// input:
//   BW - bus width (one of SDIO_BUS_xBIT constants)
// return: SDResult
// note: card must be in TRAN state and not locked, otherwise it will respond with 'illegal command'
SDResult SD_SetBusWidth(uint32_t BW) {
	SDResult cmd_res = SDR_Success;
	uint32_t reg;

	if (SDCard.Type != SDCT_MMC) {
		// Send leading command for ACMD<n> command
		SD_Cmd(SD_CMD_APP_CMD,SDCard.RCA << 16,SDIO_RESP_SHORT); // CMD55
		cmd_res = SD_Response(SD_R1,&reg);
		if (cmd_res != SDR_Success) return cmd_res;

		// Set SET_BUS_WIDTH command
		SD_Cmd(SD_CMD_SET_BUS_WIDTH,(BW == SD_BUS_1BIT) ? 0x00000000 : 0x00000002,SDIO_RESP_SHORT); // ACMD6
		cmd_res = SD_Response(SD_R1,&reg);
		if (cmd_res != SDR_Success) return cmd_res;
	} else {
		// MMC supports only 8-bit ?
	}

	// Clear bus width bits
	reg = SDIO->CLKCR & ~SDIO_CLKCR_WIDBUS;

	// Configure bus width
	SDIO->CLKCR = reg | BW;

	printf("------> BUS WIDTH %s-BIT <------\r\n",BW == SD_BUS_1BIT ? "1" : "4");

	return cmd_res;
}

// Parse information about specific card
// note: CSD/CID register values already must be in the SDCard structure
void SD_GetCardInfo(void) {
	uint32_t dev_size, dev_size_mul, rd_block_len;

	// Parse the CSD register
	SDCard.CSDVer = SDCard.CSD[0] >> 6; // CSD version
	if (SDCard.Type != SDCT_MMC) {
		// SD
		SDCard.MaxBusClkFreq = SDCard.CSD[3];
		rd_block_len = SDCard.CSD[5] & 0x0f; // Max. read data block length
		if (SDCard.CSDVer == 0) {
			// CSD v1.00 (SDSCv1, SDSCv2)
			dev_size  = (uint32_t)(SDCard.CSD[6] & 0x03) << 10; // Device size
			dev_size |= (uint32_t)SDCard.CSD[7] << 2;
			dev_size |= (SDCard.CSD[8] & 0xc0) >> 6;
			dev_size_mul  = (SDCard.CSD[ 9] & 0x03) << 1; // Device size multiplier
			dev_size_mul |= (SDCard.CSD[10] & 0x80) >> 7;
			SDCard.Capacity  = (dev_size + 1);
			SDCard.Capacity *= (1 << (dev_size_mul + 2));
			SDCard.BlockSize =  1 << (rd_block_len);
			SDCard.Capacity *= SDCard.BlockSize;
		} else {
			// CSD v2.00 (SDHC, SDXC)
			dev_size  = (SDCard.CSD[7] & 0x3f) << 16;
			dev_size |=  SDCard.CSD[8] << 8;
			dev_size |=  SDCard.CSD[9];
			SDCard.BlockSize = 512;
			SDCard.Capacity = (dev_size + 1) * SDCard.BlockSize;
		}
	} else {
		// MMC
		SDCard.MaxBusClkFreq = SDCard.CSD[3];
		dev_size  = (uint32_t)(SDCard.CSD[6] & 0x03) << 8; // C_SIZE
		dev_size += (uint32_t)SDCard.CSD[7];
		dev_size <<= 2;
		dev_size += SDCard.CSD[8] >> 6;
		SDCard.BlockSize = 1 << (SDCard.CSD[5] & 0x0f); // MMC read block length
		dev_size_mul = ((SDCard.CSD[9] & 0x03) << 1) + ((SDCard.CSD[10] & 0x80) >> 7);
		SDCard.Capacity = (dev_size + 1) * (1 << (dev_size_mul + 2)) * SDCard.BlockSize;
	}

	// Parse the CID register
	if (SDCard.Type != SDCT_MMC) {
		// SD card
		SDCard.MID = SDCard.CID[0];
		SDCard.OID = (SDCard.CID[1] << 8) | SDCard.CID[2];
		SDCard.PNM[0] = SDCard.CID[3];
		SDCard.PNM[1] = SDCard.CID[4];
		SDCard.PNM[2] = SDCard.CID[5];
		SDCard.PNM[3] = SDCard.CID[6];
		SDCard.PNM[4] = SDCard.CID[7];
		SDCard.PRV = SDCard.CID[8];
		SDCard.PSN = (SDCard.CID[9] << 24) | (SDCard.CID[10] << 16) | (SDCard.CID[11] << 8) | SDCard.CID[12];
		SDCard.MDT = ((SDCard.CID[13] << 8) | SDCard.CID[14]) & 0x0fff;
	} else {
		// MMC
		SDCard.MID = 0x00;
		SDCard.OID = 0x0000;
		SDCard.PNM[0] = '*';
		SDCard.PNM[1] = 'M';
		SDCard.PNM[2] = 'M';
		SDCard.PNM[3] = 'C';
		SDCard.PNM[4] = '*';
		SDCard.PRV = 0;
		SDCard.PSN = 0x00000000;
		SDCard.MDT = 0x0000;
	}
}

// Abort an ongoing data transfer
// return: SDResult value
SDResult SD_StopTransfer(void) {
	uint32_t response;

	// Send STOP_TRANSMISSION command
	SD_Cmd(SD_CMD_STOP_TRANSMISSION,0,SDIO_RESP_SHORT); // CMD12

	return SD_Response(SD_R1,&response);
}

// Get current SD card state
// input:
//   pStatus - pointer to the variable for current card status (SD_CS_XXX values)
// return: SDResult value
SDResult SD_GetCardState(uint8_t *pStatus) {
	uint32_t response;
	SDResult cmd_res;

	// Send SEND_STATUS command
	SD_Cmd(SD_CMD_SEND_STATUS,SDCard.RCA << 16,SDIO_RESP_SHORT); // CMD13
	cmd_res = SD_Response(SD_R1,&response);

	// Find out card status
	*pStatus = (response & 0x1e00) >> 9;

	// Check for errors
	if (response & SD_CS_ERROR_BITS) {
		if (response & SD_CS_OUT_OF_RANGE)       return SDR_AddrOutOfRange;
		if (response & SD_CS_ADDRESS_ERROR)      return SDR_AddrMisaligned;
		if (response & SD_CS_BLOCK_LEN_ERROR)    return SDR_BlockLenError;
		if (response & SD_CS_ERASE_SEQ_ERROR)    return SDR_EraseSeqError;
		if (response & SD_CS_ERASE_PARAM)        return SDR_EraseParam;
		if (response & SD_CS_WP_VIOLATION)       return SDR_WPViolation;
		if (response & SD_CS_LOCK_UNLOCK_FAILED) return SDR_LockUnlockFailed;
		if (response & SD_CS_COM_CRC_ERROR)      return SDR_ComCRCError;
		if (response & SD_CS_ILLEGAL_COMMAND)    return SDR_IllegalCommand;
		if (response & SD_CS_CARD_ECC_FAILED)    return SDR_CardECCFailed;
		if (response & SD_CS_CC_ERROR)           return SDR_CCError;
		if (response & SD_CS_ERROR)              return SDR_GeneralError;
		if (response & SD_CS_STREAM_R_UNDERRUN)  return SDR_StreamUnderrun;
		if (response & SD_CS_STREAM_W_OVERRUN)   return SDR_StreamOverrun;
		if (response & SD_CS_CSD_OVERWRITE)      return SDR_CSDOverwrite;
		if (response & SD_CS_WP_ERASE_SKIP)      return SDR_WPEraseSkip;
		if (response & SD_CS_CARD_ECC_DISABLED)  return SDR_ECCDisabled;
		if (response & SD_CS_ERASE_RESET)        return SDR_EraseReset;
		if (response & SD_CS_AKE_SEQ_ERROR)      return SDR_AKESeqError;
	}

