LonelyWolf/stm32/stm32l151rdt6-dev/sdcard-sdio.c
	return cmd_res;
}

// Read block of data from the SD card
// input:
//   addr - address of the block to be read
//   pBuf - pointer to the buffer that will contain the received data
//   length - buffer length (must be multiple of 512)
// return: SDResult value
SDResult SD_ReadBlock(uint32_t addr, uint32_t *pBuf, uint32_t length) {
	SDResult cmd_res = SDR_Success;
	uint32_t response;
	uint32_t blk_count = length / 512; // Sectors in block
	uint32_t STA; // to speed up SDIO flags checking
	uint32_t STA_mask; // mask for SDIO flags checking

	// Initialize the data control register
	SDIO->DCTRL = 0;

	// SDSC card uses byte unit address and
	// SDHC/SDXC cards use block unit address (1 unit = 512 bytes)
	// For SDHC card addr must be converted to block unit address
	if (SDCard.Type == SDCT_SDHC) addr >>= 9;

	// Clear the static SDIO flags
	SDIO->ICR = SDIO_ICR_STATIC;

	if (blk_count > 1) {
		// Send READ_MULT_BLOCK command
		SD_Cmd(SD_CMD_READ_MULT_BLOCK,addr,SDIO_RESP_SHORT); // CMD18
		// Prepare bit checking variable for multiple block transfer
		STA_mask = SDIO_STA_RXOVERR | SDIO_STA_DCRCFAIL | SDIO_STA_DTIMEOUT | SDIO_STA_STBITERR | SDIO_STA_DATAEND;
	} else {
		// Send READ_SINGLE_BLOCK command
		SD_Cmd(SD_CMD_READ_SINGLE_BLOCK,addr,SDIO_RESP_SHORT); // CMD17
		// Prepare bit checking variable for single block transfer
		STA_mask = SDIO_STA_RXOVERR | SDIO_STA_DCRCFAIL | SDIO_STA_DTIMEOUT | SDIO_STA_STBITERR | SDIO_STA_DBCKEND;
	}
	cmd_res = SD_Response(SD_R1,&response);
	if (cmd_res != SDR_Success) return cmd_res;

	// Configure the SDIO data transfer
	SDIO->DTIMER = SDIO_DATA_TIMEOUT; // Data timeout
	SDIO->DLEN   = length; // Data length
	// Data transfer: block, card -> controller, size: 2^9 = 512bytes, enable transfer
	SDIO->DCTRL  = SDIO_DCTRL_DTDIR | (9 << 4) | SDIO_DCTRL_DTEN;

	// Receive a data block from the SDIO
	// ----> TIME CRITICAL SECTION BEGIN <----
	do {
		STA = SDIO->STA;
		if (STA & SDIO_STA_RXFIFOHF) {
			// Receive FIFO half full, there are at least 8 words in it
			// This code is 80 bytes more than the 'for' loop, but faster
			*pBuf++ = SDIO->FIFO;
			*pBuf++ = SDIO->FIFO;
			*pBuf++ = SDIO->FIFO;
			*pBuf++ = SDIO->FIFO;
			*pBuf++ = SDIO->FIFO;
			*pBuf++ = SDIO->FIFO;
			*pBuf++ = SDIO->FIFO;
			*pBuf++ = SDIO->FIFO;
		}
	} while (!(STA & STA_mask));
	// <---- TIME CRITICAL SECTION END ---->

	// Send stop transmission command in case of multiblock transfer
	if ((STA & SDIO_STA_DATAEND) && (SDCard.Type != SDCT_MMC) && (blk_count > 1)) cmd_res = SD_StopTransfer();

	// Check for errors
	if (STA & SDIO_STA_DTIMEOUT) cmd_res = SDR_DataTimeout;
	if (STA & SDIO_STA_DCRCFAIL) cmd_res = SDR_DataCRCFail;
	if (STA & SDIO_STA_RXOVERR)  cmd_res = SDR_RXOverrun;
	if (STA & SDIO_STA_STBITERR) cmd_res = SDR_StartBitError;

	// Read data remnant from RX FIFO (if there is still any data)
	while (SDIO->STA & SDIO_STA_RXDAVL) *pBuf++ = SDIO->FIFO;

//	printf("SD_ReadBlock: #%d [res=%2X] {STA=%8X}\r\n",addr,cmd_res,STA);

	// Clear the static SDIO flags
	SDIO->ICR = SDIO_ICR_STATIC;

	return cmd_res;
}

// Write block of data to the SD card
// input:
//   addr - address of the block to be written
//   pBuf - pointer to the buffer that will contain the received data
//   length - buffer length (must be multiple of 512)
// return: SDResult value
SDResult SD_WriteBlock(uint32_t addr, uint32_t *pBuf, uint32_t length) {
	SDResult cmd_res = SDR_Success;
	uint32_t response; // SDIO command response
	uint32_t blk_count = length / 512; // Sectors in block
	uint32_t STA; // To speed up SDIO flags checking
	uint32_t STA_mask; // Mask for SDIO flags checking
	uint32_t bsent = 0; // Counter of transferred bytes
	uint32_t w_left; // Words counter in last portion of data
	uint8_t card_state; // Card state
	uint32_t cntr;

	// Initialize the data control register
	SDIO->DCTRL = 0;

	// SDSC card uses byte unit address and
	// SDHC/SDXC cards use block unit address (1 unit = 512 bytes)
	// For SDHC card addr must be converted to block unit address
	if (SDCard.Type == SDCT_SDHC) addr >>= 9;

	if (blk_count > 1) {
		// Send WRITE_MULTIPLE_BLOCK command
		SD_Cmd(SD_CMD_WRITE_MULTIPLE_BLOCK,addr,SDIO_RESP_SHORT); // CMD25
		// Prepare bit checking variable for multiple block transfer
		STA_mask = SDIO_STA_TXUNDERR | SDIO_STA_DCRCFAIL | SDIO_STA_DTIMEOUT | SDIO_STA_STBITERR | SDIO_STA_DATAEND;
	} else {
		// Send WRITE_BLOCK command
		SD_Cmd(SD_CMD_WRITE_BLOCK,addr,SDIO_RESP_SHORT); // CMD24
		// Prepare bit checking variable for single block transfer
		STA_mask = SDIO_STA_TXUNDERR | SDIO_STA_DCRCFAIL | SDIO_STA_DTIMEOUT | SDIO_STA_STBITERR | SDIO_STA_DBCKEND;
	}
	cmd_res = SD_Response(SD_R1,&response);
	if (cmd_res != SDR_Success) return cmd_res;

	// Clear the static SDIO flags
	SDIO->ICR = SDIO_ICR_STATIC;

	// Configure the SDIO data transfer
	SDIO->DTIMER = SDIO_DATA_TIMEOUT; // Data timeout
	SDIO->DLEN   = length; // Data length
	// Data transfer: block, controller -> card, size: 2^9 = 512bytes, enable transfer
	SDIO->DCTRL  = (9 << 4) | SDIO_DCTRL_DTEN;

	// Transfer data block to the SDIO
	// ----> TIME CRITICAL SECTION BEGIN <----
	__disable_irq();
	if (!(length % 32)) {
		// The block length is multiple of 32, use simplified and faster transfer
		do {
			STA = SDIO->STA;
			if ((STA & SDIO_STA_TXFIFOHE) && (bsent < length)) {
				// TX FIFO half empty, at least 8 words can be written
				SDIO->FIFO = *pBuf++;
				SDIO->FIFO = *pBuf++;
				SDIO->FIFO = *pBuf++;
				SDIO->FIFO = *pBuf++;
				SDIO->FIFO = *pBuf++;
				SDIO->FIFO = *pBuf++;
				SDIO->FIFO = *pBuf++;
				SDIO->FIFO = *pBuf++;
				bsent += 32;
			}
		} while (!(STA & STA_mask));
	} else {
		// The block length is not a multiple of 32, so it is necessary to apply additional calculations
		do {
			STA = SDIO->STA;
			if ((STA & SDIO_STA_TXFIFOHE) && (bsent < length)) {
				// TX FIFO half empty, at least 8 words can be written
				if (length - bsent < 32) {
					// Write last portion of data to the TX FIFO
					w_left = ((length - bsent) % 4 == 0) ? ((length - bsent) >> 2) : (((length - bsent) >> 2) + 1);
					for (cntr = 0; cntr < w_left; cntr++) SDIO->FIFO = *pBuf++;
					bsent += w_left << 2;
				} else {
					// Write 8 words to the TX FIFO
					SDIO->FIFO = *pBuf++;
					SDIO->FIFO = *pBuf++;
					SDIO->FIFO = *pBuf++;
					SDIO->FIFO = *pBuf++;
					SDIO->FIFO = *pBuf++;
					SDIO->FIFO = *pBuf++;
					SDIO->FIFO = *pBuf++;
					SDIO->FIFO = *pBuf++;
					bsent += 32;
				}
			}
		} while (!(STA & STA_mask));
	}
	__enable_irq();
	// <---- TIME CRITICAL SECTION END ---->

	// Send stop transmission command in case of multiblock transfer
	if ((STA & SDIO_STA_DATAEND) && (SDCard.Type != SDCT_MMC) && (blk_count > 1)) cmd_res = SD_StopTransfer();

	printf("SD_WriteBlock: #%u [res=%X] {STA=%X DCOUNT=%u} blk=%d sent=%d",addr,cmd_res,STA,SDIO->DCOUNT,blk_count,bsent);
	printf(" [%s%s%s%s]\r\n", \
			(STA & SDIO_STA_DTIMEOUT) ? "DTIMEOUT " : "", \
			(STA & SDIO_STA_DCRCFAIL) ? "DCRCFAIL " : "", \
			(STA & SDIO_STA_TXUNDERR) ? "TXUNDERR " : "", \
			(STA & SDIO_STA_STBITERR) ? "STBITERR"  : ""  \
					);

	// Check for errors
	if (STA & SDIO_STA_DTIMEOUT) return SDR_DataTimeout;
	if (STA & SDIO_STA_DCRCFAIL) return SDR_DataCRCFail;
	if (STA & SDIO_STA_TXUNDERR) return SDR_TXUnderrun;
	if (STA & SDIO_STA_STBITERR) return SDR_StartBitError;

	// Wait till the card is in programming state
	do {
		cmd_res = SD_GetCardState(&card_state);
	} while ((cmd_res == SDR_Success) && ((card_state == SD_STATE_PRG) || (card_state == SD_STATE_RCV)));

	// Clear the static SDIO flags
	SDIO->ICR = SDIO_ICR_STATIC;

