LonelyWolf/stm32/stm32l151rdt6-dev/sdcard-sdio.c
	return cmd_res;
}

// Initialize the DMA channel for SDIO peripheral (DMA2 Channel4)
// input:
//   direction - DMA channel direction (Memory -> SDIO or SDIO -> Memory), one of SD_DMA_XX values
//   pBuf - pointer to memory buffer
//   length - memory buffer size in bytes (must be a multiple of 4, since SDIO operates 32-bit words)
// note: the DMA2 peripheral clock must be already enabled
void SD_Cofigure_DMA(uint8_t direction, uint32_t *pBuf, uint32_t length) {
	uint32_t reg;

	// Clear DMA configuration bits
	reg = SDIO_DMA_CH->CCR & ((uint32_t)~(DMA_CCR1_MEM2MEM | DMA_CCR1_PL | DMA_CCR1_MSIZE | \
			DMA_CCR1_PSIZE | DMA_CCR1_MINC | DMA_CCR1_PINC | DMA_CCR1_CIRC | DMA_CCR1_DIR | DMA_CCR1_EN));
	SDIO_DMA_CH->CCR = reg; // Disable DMA channel in case if it enabled

	// Address of the peripheral data register
	SDIO_DMA_CH->CPAR = (uint32_t)(&(SDIO->FIFO));

	// Address of the memory buffer
	SDIO_DMA_CH->CMAR = (uint32_t)pBuf;

	// Buffer length
	SDIO_DMA_CH->CNDTR = length >> 2; // SDIO operates with 32-bit words

	// Clear DMA2 interrupt flags
//	DMA2->IFCR = (DMA_IFCR_CGIF4 | DMA_IFCR_CHTIF4 | DMA_IFCR_CTCIF4 | DMA_IFCR_CTEIF4);

	// DMA: no circular mode, 32-bits, memory increment, very high channel priority, channel enabled
	reg |= (DMA_CCR1_MINC | DMA_CCR1_PL | DMA_CCR1_MSIZE_1 | DMA_CCR1_PSIZE_1 | DMA_CCR1_EN);
	if (direction != SD_DMA_RX) reg |= DMA_CCR1_DIR; // DMA will read from memory

	// Enable IRQ
//	reg |= (DMA_CCR1_TCIE | DMA_CCR1_TEIE);

	SDIO_DMA_CH->CCR = reg;
}

// Start reading of data block from the SD card with DMA transfer
// input:
//   addr - address of the block to be read
//   pBuf - pointer to the buffer that will contain the received data
//   length - buffer length (must be multiple of 512)
// return: SDResult value
SDResult SD_ReadBlock_DMA(uint32_t addr, uint32_t *pBuf, uint32_t length) {
	SDResult cmd_res = SDR_Success;
	uint32_t response;
	uint32_t blk_count = length / 512; // Sectors in block

	// Initialize the data control register
	SDIO->DCTRL = 0;

	// SDSC card uses byte unit address and
	// SDHC/SDXC cards use block unit address (1 unit = 512 bytes)
	// For SDHC card addr must be converted to block unit address
	if (SDCard.Type == SDCT_SDHC) addr >>= 9;

	if (blk_count > 1) {
		// Send READ_MULT_BLOCK command
		SD_Cmd(SD_CMD_READ_MULT_BLOCK,addr,SDIO_RESP_SHORT); // CMD18
	} else {
		// Send READ_SINGLE_BLOCK command
		SD_Cmd(SD_CMD_READ_SINGLE_BLOCK,addr,SDIO_RESP_SHORT); // CMD17
	}
	cmd_res = SD_Response(SD_R1,&response);
	if (cmd_res != SDR_Success) return cmd_res;

	// Clear the static SDIO flags
	SDIO->ICR = SDIO_ICR_STATIC;

	// Configure the DMA to receive data from SDIO
	SD_Cofigure_DMA(SD_DMA_RX,pBuf,length);

	// Configure the SDIO data transfer
	SDIO->DTIMER = SDIO_DATA_TIMEOUT; // Data timeout
	SDIO->DLEN   = length; // Data length
	// Data transfer: DMA enable, block, card -> controller, size: 2^9 = 512bytes, enable transfer
	SDIO->DCTRL  = SDIO_DCTRL_DMAEN | SDIO_DCTRL_DTDIR | (9 << 4) | SDIO_DCTRL_DTEN;

	return cmd_res;
}

// Start writing block of data to the SD card with DMA transfer
// input:
//   addr - address of the block to be written
//   pBuf - pointer to the buffer that will contain the received data
//   length - buffer length (must be multiple of 512)
// return: SDResult value
SDResult SD_WriteBlock_DMA(uint32_t addr, uint32_t *pBuf, uint32_t length) {
	SDResult cmd_res = SDR_Success;
	uint32_t response; // SDIO command response
	uint32_t blk_count = length / 512; // Sectors in block

	// Initialize the data control register
	SDIO->DCTRL = 0;

	// SDSC card uses byte unit address and
	// SDHC/SDXC cards use block unit address (1 unit = 512 bytes)
	// For SDHC card addr must be converted to block unit address
	if (SDCard.Type == SDCT_SDHC) addr >>= 9;

	if (blk_count > 1) {
		// Send WRITE_MULTIPLE_BLOCK command
		SD_Cmd(SD_CMD_WRITE_MULTIPLE_BLOCK,addr,SDIO_RESP_SHORT); // CMD25
	} else {
		// Send WRITE_BLOCK command
		SD_Cmd(SD_CMD_WRITE_BLOCK,addr,SDIO_RESP_SHORT); // CMD24
	}
	cmd_res = SD_Response(SD_R1,&response);
	if (cmd_res != SDR_Success) return cmd_res;

	// Clear the static SDIO flags
	SDIO->ICR = SDIO_ICR_STATIC;

	// Configure the DMA to send data to SDIO
	SD_Cofigure_DMA(SD_DMA_TX,pBuf,length);

	// Configure the SDIO data transfer
	SDIO->DTIMER = SDIO_DATA_TIMEOUT; // Data timeout
	SDIO->DLEN   = length; // Data length
	// Data transfer: DMA enable, block, controller -> card, size: 2^9 = 512bytes, enable transfer
	SDIO->DCTRL  = SDIO_DCTRL_DMAEN | (9 << 4) | SDIO_DCTRL_DTEN;

	return cmd_res;
}

// This function waits until the SDIO DMA data read transfer is finished
// It must be called after SD_ReadBlock_DMA() function to ensure that all
// data sent by the SD card is already transfered by the DMA and send STOP
// command in case of multiblock transfer
// input:
//   length - buffer length (must be multiple of 512)
// note: length passed here to determine if it was mutliblock transfer
SDResult SD_CheckRead(uint32_t length) {
	SDResult cmd_res = SDR_Success;
	uint32_t blk_count = length / 512; // Sectors in block
	uint32_t wait = SDIO_DATA_TIMEOUT;
	uint32_t SDIO_active;
	uint32_t STA;

	// Wait for DMA/SDIO transfer end or error occurred
	do {
		STA = SDIO->STA;
		SDIO_active = (STA & SDIO_STA_RXACT) ? 1 : 0;
	} while (SDIO_active && --wait);

	// Disable the DMA channel
	SDIO_DMA_CH->CCR &= ~DMA_CCR1_EN;

	// Send stop transmission command in case of multiblock transfer
	if ((SDCard.Type != SDCT_MMC) && (blk_count > 1)) cmd_res = SD_StopTransfer();

	// Check for errors
	if (STA & SDIO_STA_DTIMEOUT) cmd_res = SDR_DataTimeout;
	if (STA & SDIO_STA_DCRCFAIL) cmd_res = SDR_DataCRCFail;
	if (STA & SDIO_STA_RXOVERR)  cmd_res = SDR_RXOverrun;
	if (STA & SDIO_STA_STBITERR) cmd_res = SDR_StartBitError;

	// Clear the static SDIO flags
	SDIO->ICR = SDIO_ICR_STATIC;

	// Check for timeout
	if (!wait) cmd_res = SDR_Timeout;

	return cmd_res;
}

// This function waits until the SDIO DMA data write transfer is finished
// It must be called after SD_WriteBlock_DMA() function to ensure that all
// data is already transfered by the DMA to SD card and send STOP command
// in case of multiblock transfer
// input:
//   length - buffer length (must be multiple of 512)
// note: length passed here to determine if it was mutliblock transfer
SDResult SD_CheckWrite(uint32_t length) {
	SDResult cmd_res = SDR_Success;
	uint32_t blk_count = length / 512; // Sectors in block
	uint32_t wait = SDIO_DATA_TIMEOUT >> 10;
	uint32_t SDIO_active;
	uint32_t STA;
	uint8_t card_state; // Card state

	// Wait for DMA/SDIO transfer end or error occurred
	wait = 100;
	printf("DMA write: ");
	do {
		STA = SDIO->STA;
		SDIO_active = (STA & SDIO_STA_TXACT) ? 1 : 0;
		printf("[%X %u %u %X] ",STA,DMA2_Channel4->CNDTR,SDIO->DCOUNT,DMA2->ISR);
	} while (SDIO_active && --wait);
	printf("\r\nCheckWrite: STA=%X DCOUNT=%u DMA=%u DMA2=%X wait=%u",STA,SDIO->DCOUNT,SDIO_DMA_CH->CNDTR,DMA2->ISR,wait);

	printf(" [%s%s%s%s]\r\n", \
			(STA & SDIO_STA_DTIMEOUT) ? "DTIMEOUT " : "", \
			(STA & SDIO_STA_DCRCFAIL) ? "DCRCFAIL " : "", \
			(STA & SDIO_STA_TXUNDERR) ? "TXUNDERR " : "", \
			(STA & SDIO_STA_STBITERR) ? "STBITERR"  : ""  \
					);

	// Disable the DMA channel
	SDIO_DMA_CH->CCR &= ~DMA_CCR1_EN;

	// Send stop transmission command in case of multiblock transfer
	if ((SDCard.Type != SDCT_MMC) && (blk_count > 1)) cmd_res = SD_StopTransfer();

	// Check for errors
	if (!wait && (cmd_res == SDR_Success)) return SDR_Timeout; // Wait loop timeout
	if (STA & SDIO_STA_DTIMEOUT) return SDR_DataTimeout;
	if (STA & SDIO_STA_DCRCFAIL) return SDR_DataCRCFail;
	if (STA & SDIO_STA_TXUNDERR) return SDR_TXUnderrun;
	if (STA & SDIO_STA_STBITERR) return SDR_StartBitError;

	// Wait till the card is in programming state
	do {
		cmd_res = SD_GetCardState(&card_state);
	} while ((cmd_res == SDR_Success) && ((card_state == SD_STATE_PRG) || (card_state == SD_STATE_RCV)));

	// Clear the static SDIO flags
	SDIO->ICR = SDIO_ICR_STATIC;

	return cmd_res;
}
